[
  {
    "timestamp": "20/03/2025 22:53:29",
    "name": "Shyaam",
    "companyName": "Referloan Pvt Ltd",
    "review": "Working with Pradeep has been an absolute pleasure! He's not only incredibly skilled in UI development, but he also brings such attention to detail and creativity to every project. His ability to transform designs into beautiful, user-friendly interfaces is impressive. Plus, he's always approachable, collaborative, and fun to work with. I’ve truly enjoyed every moment working alongside him!",
    "linkedinProfile": "",
    "rating": 5,
    "companyProfileOrWebsite": "https://referloan.in/"
  },
  {
    "timestamp": "20/03/2025 23:04:03",
    "name": "Bhavna",
    "companyName": "Navtech",
    "review": "It was great experience working with him, understands requirement quickly. Very good control on skills and excellent work done.",
    "linkedinProfile": "",
    "rating": 5,
    "companyProfileOrWebsite": "https://navtech.io/"
  },
  {
    "timestamp": "20/03/2025 23:07:13",
    "name": "Rishabh Dubey",
    "companyName": "Referloan",
    "review": "An excellent teammate with a strong skill set and effective leadership abilities.",
    "linkedinProfile": "https://www.linkedin.com/in/rishabhdubey-244",
    "rating": 5,
    "companyProfileOrWebsite": "www.referloan.in"
  },
  {
    "timestamp": "20/03/2025 23:12:31",
    "name": "Nikhil",
    "companyName": "Wizehire",
    "review": "Amazing skill set and excellent work done for my project. Really appreciate all the help he has done by extending his support during weekend and working late hours to meet clients need.",
    "linkedinProfile": "",
    "rating": 5,
    "companyProfileOrWebsite": "https://wizehire.com/"
  },
  {
    "timestamp": "20/03/2025 23:13:16",
    "name": "Vishal",
    "companyName": "Vdesks Solutions Pvt Ltd",
    "review": "Pradeep is an exceptionally skilled UI developer and a fantastic team lead. His expertise in HTML, CSS, and JavaScript, combined with his leadership qualities, make him an invaluable asset. He consistently delivers high-quality, responsive designs while guiding the team with clarity and patience. Working with him has been a rewarding experience!",
    "linkedinProfile": "vishal.vdesks",
    "rating": 5,
    "companyProfileOrWebsite": "Vdesks.com"
  }
]
